#ifndef _AD_KEY_H
#define _AD_KEY_H

/******************************1、头文件****************************************/
#include "pin_remap.h"
#include "stm32f10x.h"



/*******************************2、宏定义***************************************/




/*******************************3、类型定义**************************************/
typedef enum 
{
	KEY_AD1_1=0,
	KEY_AD1_2,
	KEY_AD1_3,
	KEY_AD1_4,
	KEY_AD1_5,
	KEY_AD1_6,
	KEY_AD1_7,
	KEY_AD1_8,
	KEY_AD2_1,
	KEY_AD2_2,
	KEY_AD2_3,
	KEY_AD2_4,
	KEY_AD2_5,
	KEY_AD2_6,
	KEY_AD2_7,
	KEY_AD2_8,
}KeyEnum;



/*******************************4、声明变量**************************************/




/*******************************5、声明函数***************************************/
void KeyConfig(void);                       
KeyEnum GetKeyValue(void);      



#endif




